
import { Decoration, Chapter, DecorationType } from './types';

export const INITIAL_DECORATIONS: Decoration[] = [
  { id: 'd1', type: 'santa', x: 10, y: 15, scale: 1.5, visible: true }, // Higher up
  { id: 'd2', type: 'tree', x: 85, y: 65, scale: 2.0, visible: true }, // Bigger
  { id: 'd3', type: 'snowman', x: 15, y: 75, scale: 1.5, visible: true },
];

export const INITIAL_CHAPTERS = [
  {
    "id": "c1",
    "title": "第一章：开始的篇章",
    "heroTitle": "小答老师，你好哇！",
    "heroSubtitle": "很开心认识你，虽然是暴雨天🌧️\n但我开始不那么讨厌坏天气",
    "weather": "rain",
    "decorations": [
      {
        "id": "deco-1763895735376-m44qp",
        "type": "umbrella",
        "x": 18.489583333333336,
        "y": 51.746031746031754,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763895739049-9lgxy",
        "type": "milk",
        "x": 91.40625,
        "y": 77.77777777777779,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763895751230-mys8z",
        "type": "dog",
        "x": 12.291666666666666,
        "y": 66.45502645502646,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763895751953-panq5",
        "type": "cat",
        "x": 18.28125,
        "y": 65.71428571428571,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763895759535-6qz0t",
        "type": "umbrella",
        "x": 12.395833333333334,
        "y": 51.53439153439153,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763895779755-1svin",
        "type": "milk",
        "x": 75.36458333333333,
        "y": 42.96296296296296,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896368125-5qj61",
        "type": "film",
        "x": 12.916666666666668,
        "y": 86.45502645502646,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896368566-j8ouz",
        "type": "film",
        "x": 86.5625,
        "y": 45.3968253968254,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896369363-66irq",
        "type": "popcorn",
        "x": 23.229166666666668,
        "y": 35.026455026455025,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896369655-94abe",
        "type": "popcorn",
        "x": 81.25,
        "y": 62.96296296296296,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896371181-thiss",
        "type": "flash",
        "x": 81.25,
        "y": 21.48148148148148,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896371485-fez3v",
        "type": "flash",
        "x": 25.624999999999996,
        "y": 15.76719576719577,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1763896371801-l3zjf",
        "type": "flash",
        "x": 16.71875,
        "y": 23.28042328042328,
        "scale": 1,
        "visible": true
      }
    ],
    "posts": [
      {
        "id": "p-1763894205812-dal8w2prh",
        "title": "第一次发帖",
        "content": "亲爱的苗苗，今天是我第一次发帖，也是我第一次做网站，还不知道能不能成功呢，也不知道你能不能看见这个网站。嘻嘻，其实我之前尝试过，但是失败了，如果成功了，我希望你看见之后会喜欢这份礼物！如果失败了，我想让你知道在很多你看不见的地方我也在悄悄爱着你喔。第一篇用于测试，我就先写这么多啦~",
        "date": "2025-11-21",
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1763894761792-ay6ht63b0",
        "title": "第二次发帖",
        "content": "亲爱的喵喵老师，我跟你说哦，我好像已经成功啦！也太开心！这就是我送你的礼物哦，这几天我真的专心致志在做这个，虽然有AI的帮助，但是做起来还是很麻烦，因为一些工具、创意、还有部署啥的AI并不能帮到我，期间还有好几次，我已经做了差不多但是可恶啊，怎么也找不到了，只好重新来过。哼哼哼，如何呢，我真厉害，应该是完成啦，不知道后期会不会还有什么问题，希望不会啦~爱你~",
        "date": "2025-11-23",
        "mediaUrl": "images/1_2.jpg",
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1763984984378-drtj96f2t",
        "title": "可恶的组会🫩",
        "content": "    今天是周一，明天又是开组会的日子啦，好烦，好困。\n    如何呢？其实这周还是有点拖延，哦不对不对，这周一直在做事，主要是做这个网页花了我两三天，希望你看到会喜欢，此时此刻已经完成的大差不差了，但是访问的话还要连外网，可能到这就结束了？也可能我会再去试试看还有什么招不，昨天看了个教学，还蛮难的，有点劝退。\n    这个网站什么时候给你看我还没想好呢，是圣诞节？还是元旦？我原本是打算圣诞节给你的，再加上一些装饰，你看多有节日气氛啊，但是呢，去年跨年没和你一起，你表示过很多次的遗憾，这个礼物🎁我觉得还算用心吧，也是我手搓做了好久的。好吧！要不还是当作圣诞礼物吧！去年是手搓做了一个圣诞小树🎄，今年是一个圣诞网页🛜，也是不错吧！\n    好吧好吧，其实我现在并不知道写些什么内容，你可以把这里当作我的随笔，我的日记，我想对你说的话，我想对自己说的话，这里是全世界只有我们两个知道，只有我们两个来过的地方。所以内容可能会有些乱，希望你不要介意~\n    爱你~我要继续做组会了！！",
        "date": "2025-11-24",
        "images": [],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1763987064887-6h6dfw7r3",
        "title": "下雨啦🌧",
        "content": "笑一笑🥰跳一跳💃🏻\n快乐女孩没烦恼\n下雨了洗个澡🌦\n没有什么大不了",
        "date": "2025-11-24",
        "mediaUrl": "images/1_4_1.jpg",
        "images": [
          "images/1_4_1.jpg",
          "images/1_4_2.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1763987861591-1ksjl8nck",
        "title": "天晴啦🌞",
        "content": "笑一笑😄跳一跳🕺🏽\n快乐女孩乐逍遥\n天晴了空气中🌈\n都是成长的味道",
        "date": "2025-11-24",
        "mediaUrl": "images/1_5_1.jpg",
        "images": [
          "images/1_5_1.jpg",
          "images/1_5_2.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1764144958207-pbwihc4as",
        "title": "怒了💢💢💢",
        "content": "    今天看电视剧的时候，你说想我，你蛮伤心的。你说我很久没有认真写日记，还说我们一路走来丢了很多东西。我说没有丢，只是在换，你只说了三个字“换回来”，随即撤回了，好吧，我还蛮伤心的，或许你更喜欢以前的我。\n    我已写上，我已心碎💔\n    其实我在这里给你写日记，哼哼，我开发的地方哦，牛不牛，居然说我不写日记，哼哼，我在记仇。好吧并不会，其实我是爱你的，其实你也舍不得。学习！！！",
        "date": "2025-11-26",
        "images": [],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1764491634901-detbddgoy",
        "title": "你不参加国考吗",
        "content": "    今天是11月最后一天喽，时间过得真快。\n\t现在好多情绪交织在一起呀，又开心又烦，还有好多事要做，窗外喜鹊一直叫呢，太阳也透过窗帘缝照在我的脸上，并不觉得刺眼，想出去走走。\n\t今天已是国考，听说资格审查过的人数和国考岗位招人的人数的比例是98:1，好牛的国考人，考上真的是百里挑一了，果然公务员还是有过人之处。但是此时此刻，国考貌似还剩下4分钟就结束啦，真替他们感到开心，至少刚考完的他们应该是蛮开心的，虽然一周后还有省考。\n\t什么时候这种日子才能结束呢？这种日子结束后会是什么样的日子呢？是不是我想的太多做的太少了，我刷个厕所我都要想好多天，我想在网上买橡胶手套，买口罩，买专门的刷子，买洁厕灵，但是迟迟没有买，所以就迟迟没有刷。其实呢，压根不需要这些，只是去楼下超市买一瓶6块钱的洁厕灵便可以完成这件事，从购入到清洁完也仅需半小时。好吧，恐怕是我想的太多，但又没实际去做，你也经常鼓励我，我是畏首畏尾的，疑窦丛生的，但是又什么事情都想不明白。\n\t太菜太菜，如何呢？今天阳光真好啊，落日余晖好温柔，不晒但还是暖，再过两天我就去找你啦，希望天气还是这般好，我们是出去走走呢还是房间里待着呢？都好都好。",
        "date": "2025-11-30",
        "images": [],
        "mediaType": "image",
        "likes": 0
      }
    ],
    "bgmUrl": "bgm/%E5%BF%AB%E4%B9%90%E5%A5%B3%E5%AD%A9.mp3"
  },
  {
    "id": "c-1763882830286-0.9762468187284853",
    "title": "第二章：春天来啦！",
    "heroTitle": "你来到我的城市🚄",
    "heroSubtitle": "喝一杯星巴克☕️\n赠送一把名刀司命🗡\n抵御一次防御塔攻击🗼",
    "weather": "sunny",
    "decorations": [
      {
        "id": "deco-1764493312387-qyk8u",
        "type": "temple",
        "x": 80.1255230125523,
        "y": 59.84848484848485,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493321302-a5ql8",
        "type": "camera",
        "x": 76.56903765690377,
        "y": 79.11255411255411,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493321667-iex52",
        "type": "camera",
        "x": 90.5857740585774,
        "y": 65.6926406926407,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493337789-ekgen",
        "type": "train",
        "x": 22.384937238493723,
        "y": 37.01298701298701,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493340223-tbwq7",
        "type": "train",
        "x": 79.39330543933055,
        "y": 30.627705627705627,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493343271-a541v",
        "type": "ticket",
        "x": 24.006276150627613,
        "y": 61.36363636363637,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493343520-fgx6i",
        "type": "ticket",
        "x": 91.47489539748955,
        "y": 37.44588744588744,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493344229-ypzxn",
        "type": "ticket",
        "x": 11.872384937238493,
        "y": 30.844155844155846,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493354062-0c79f",
        "type": "tree",
        "x": 7.426778242677824,
        "y": 88.96103896103897,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493358084-8n6du",
        "type": "tree",
        "x": 11.92468619246862,
        "y": 88.96103896103897,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493368084-wkoll",
        "type": "camera",
        "x": 13.07531380753138,
        "y": 55.41125541125541,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493382723-3z59k",
        "type": "cat",
        "x": 10.847164958278999,
        "y": 72.18736587110288,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493383387-gebhd",
        "type": "dog",
        "x": 15.167364016736402,
        "y": 72.72727272727273,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493400424-l8ayz",
        "type": "tree",
        "x": 16.265690376569037,
        "y": 88.74458874458875,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493406964-48cu9",
        "type": "tree",
        "x": 20.135983263598327,
        "y": 88.52813852813853,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493427784-37069",
        "type": "beatheart",
        "x": 74.7907949790795,
        "y": 45.67099567099567,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493433171-d12vi",
        "type": "flower",
        "x": 87.76150627615063,
        "y": 84.4155844155844,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1764493434503-5gzrl",
        "type": "flower",
        "x": 85.61715481171548,
        "y": 17.64069264069264,
        "scale": 1,
        "visible": true
      }
    ],
    "posts": [
      {
        "id": "p-1763889385023-xl8g1w2sw",
        "title": "杭州东站欢迎您❤️",
        "content": "如此可爱的小女子一枚啊",
        "date": "2025-12-18",
        "mediaUrl": "/images/pic1.jpg",
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767788006864-snmobzw5s",
        "title": "小苗小旺和可乐",
        "content": "郑州的冬天好冷啊\n不过现在还能记得小屋的样子和味道\n还能记得下楼的时候冷的感觉\n冷的好深刻、好清晰\n不过冷的好幸福",
        "date": "2025-12-01",
        "mediaUrl": "images/2_2_1.jpg",
        "images": [
          "images/2_2_1.jpg",
          "images/2_2_2.jpg",
          "images/2_2_3.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767788722251-f5271sr0i",
        "title": "郑州郑州我们喜欢你",
        "content": "发现对郑州已全是好印象\n姐姐在郑州当时你也在郑州\n接地气、物价低\n最重要的是承载了太多我俩的回忆",
        "date": "2025-12-04",
        "mediaUrl": "images/2_3_1.jpg",
        "images": [
          "images/2_3_1.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767788809336-ky50pm0cw",
        "title": "纳尼(ÒωÓױ)！如此萌物竟有两只！😱",
        "content": "有点磕他俩了🤔",
        "date": "2025-12-10",
        "mediaUrl": "images/2_4_1.jpg",
        "images": [
          "images/2_4_1.jpg",
          "images/2_4_2.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767789415793-1hxqu0t7a",
        "title": "青城山下赵喵喵",
        "content": "偶然发现这些照片当时属于是随手一拍（虽然现在看也是属于随手一拍哈），但是再翻看的时候感觉很有活人感，虽然背景很多人，但是好像他们都是NPC，我俩是主角！如此可爱的两个人呀😊我永远爱你宝宝",
        "date": "2025-12-19",
        "mediaUrl": "images/2_6_1.jpg",
        "images": [
          "images/2_6_1.jpg",
          "images/2_6_2.jpg",
          "images/2_6_3.jpg",
          "images/2_6_4.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767798323793-o3aqy8xd0",
        "title": "小鱼老师！",
        "content": "∠(°ゝ°)到！！！",
        "date": "2025-12-21",
        "mediaUrl": "images/2_8_1.jpg",
        "images": [
          "images/2_8_1.jpg",
          "images/2_8_2.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767798634403-pp8z5ce78",
        "title": "夜骑西湖🚴",
        "content": "是第一次也是印象最深的一次\n好开心的一晚\n只是最后没有看到日出有点可惜啦\n不过这也使得我们第二次去夜骑！（不对是夜走）\n第二天还在开组会的办公室补了觉\n我会一辈子记得！",
        "date": "2025-12-22",
        "mediaUrl": "images/2_9_1.jpg",
        "images": [
          "images/2_9_1.jpg",
          "images/2_9_2.jpg",
          "images/2_9_3.jpg",
          "images/2_9_4.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767800006663-z3uayzdf9",
        "title": "ShangHai",
        "content": "虽然上海是巨巨巨巨大的一座城市\n但还是很幸运在这座城市的某个角落和苗苗一起\n度过了非常多快乐的时光\n张江站的十字路口有好多小摊\n西瓜摊、淀粉肠摊、烧烤摊、卤味摊\n最喜欢夏天的西瓜摊了，每次路过我们都要买半个西瓜\n西瓜就是夏天，夏天就是西瓜\n后来西瓜摊不见了夏天也就不见了\n我们在大晚上经常会一起出门\n还是夏天的夜晚比较喜人，我们吃过好多次烧烤，拍过好几次照，喂过好几次小猫\n在夏天，我们和星星一起，都不睡觉\n后来，我找到实习啦\n第一个月狠狠赚了150块，all in买花了\n真的很喜欢每次苗苗开地铁来接我的样子\n她真的好有女人味儿，爱了\n然后哦，我们还在上海吃过好几次六合酥山店\n真不错啊，就是老板有点邋遢，像乞丐\n还有一个人留着小胡子，感觉坏坏的",
        "date": "2025-12-23",
        "mediaUrl": "images/2_10_1.jpg",
        "images": [
          "images/2_10_1.jpg",
          "images/2_10_2.jpg",
          "images/2_10_3.jpg",
          "images/2_10_4.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767800984246-qv8ptzr7q",
        "title": "西瓜摊再也没有来过了",
        "content": "暑假就要接近尾声了\n我们一起去了苏州，苏州的妆造真不错\n虽然我最最喜欢的还是你和我在公车上的样子\n火腿肠现在也不知道在哪里打劫路人，也有可能是在行侠仗义啦\n在杭州大莲花，和苗苗一起看了我人生中第一场演唱会\n是陶喆的喂！太开心的一天\n看完演唱会后，我们又转战景德镇啦\n江西菜真的好好好好好好吃\n感觉这个暑假，我可能一生都会想念这个暑假了\n有太多日子，太多件事值得我记住一辈子了\n宝宝，我永远爱你\n可能\n一辆银灰色小车会在明年某个夜晚的蝉鸣中\n再次开到十字路口，带来一整车的夏天🍉",
        "date": "2026-01-07",
        "mediaUrl": "images/2_11_1.jpg",
        "images": [
          "images/2_11_1.jpg",
          "images/2_11_2.jpg",
          "images/2_11_3.jpg",
          "images/2_11_4.jpg",
          "images/2_11_5.jpg",
          "images/2_11_6.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1767802473450-kd03cvc8m",
        "title": "日子开始变得丰富多彩啦🌈",
        "content": "🌈🌈🌈",
        "date": "2025-12-20",
        "mediaUrl": "images/2_7_1.jpg",
        "images": [
          "images/2_7_1.jpg",
          "images/2_7_2.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      }
    ],
    "bgmUrl": "bgm/%E5%8F%88%E6%98%AF%E8%89%B3%E9%98%B3%E5%A4%A9.mp3"
  },
  {
    "id": "c-1763889537549-0.7878904477871393",
    "title": "第三章：圣诞快乐🎄",
    "heroTitle": "我住的城市从不下雪❄️",
    "heroSubtitle": "你好吗merry merry Christmas\n想和你有更好的生活",
    "weather": "snow",
    "decorations": [
      {
        "id": "d1",
        "type": "santa",
        "x": 10,
        "y": 15,
        "scale": 1.5,
        "visible": true
      },
      {
        "id": "d3",
        "type": "snowman",
        "x": 7.552083333333333,
        "y": 71.11111111111111,
        "scale": 1.5,
        "visible": true
      },
      {
        "id": "deco-1767802820624-nodal",
        "type": "bell",
        "x": 79.94791666666666,
        "y": 29.31216931216931,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802821322-vd9me",
        "type": "bell",
        "x": 24.635416666666668,
        "y": 74.28571428571429,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802833633-auf2n",
        "type": "gift",
        "x": 78.95833333333333,
        "y": 52.59259259259259,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802833900-zmydn",
        "type": "gift",
        "x": 6.09375,
        "y": 44.44444444444444,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802834513-ahtul",
        "type": "sock",
        "x": 91.51041666666667,
        "y": 77.77777777777779,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802834670-6av78",
        "type": "sock",
        "x": 90.88541666666666,
        "y": 21.48148148148148,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802836218-pcy5z",
        "type": "bigtree",
        "x": 80.36458333333333,
        "y": 75.66137566137566,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802836378-nohv2",
        "type": "bigtree",
        "x": 17.916666666666668,
        "y": 47.40740740740741,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802836497-wo4tl",
        "type": "bigtree",
        "x": 93.54166666666667,
        "y": 48.783068783068785,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802837167-pedal",
        "type": "bigtree",
        "x": 18.697916666666668,
        "y": 90.05291005291005,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802886657-wbbzn",
        "type": "snowman",
        "x": 86.5625,
        "y": 46.24338624338624,
        "scale": 1,
        "visible": true
      },
      {
        "id": "deco-1767802887162-wngh9",
        "type": "snowman",
        "x": 24.635416666666668,
        "y": 32.06349206349206,
        "scale": 1,
        "visible": true
      }
    ],
    "posts": [
      {
        "id": "p-1763889574742-w1qhlptir",
        "title": "s ",
        "content": "w ",
        "date": "2025-11-16",
        "mediaUrl": "/images/test3.jpg",
        "mediaType": "image",
        "likes": 0
      },
      {
        "id": "p-1766818314747-kseo9ftwy",
        "title": "假如生活欺骗了你",
        "content": "宝宝，今晚回来你很难过\n因为老太婆同事的事情你跟我哭了一场\n好可怜的苗苗\n心疼你宝宝\n可能你现在看到的时候已经没有难受的感觉啦\n不过我想起来一首诗\n这次想起来再读\n比第一次在课本中学到的时候更有感触\n一切都是瞬息，一切都将会过去\n快乐的日子将会来临宝宝\n爱你",
        "date": "2025-12-26",
        "mediaUrl": "images/iflie.jpg",
        "images": [
          "images/iflie.jpg"
        ],
        "mediaType": "image",
        "likes": 0
      }
    ],
    "bgmUrl": "bgm/%E5%88%9D%E9%9B%AA.mp3"
  },
  {
    "id": "c-1767838308832-0.575099296845854",
    "title": "不止500天！",
    "heroTitle": "我将永远爱你",
    "heroSubtitle": "喵喵汪汪forever🐶🐱\n",
    "weather": "starry",
    "decorations": [
      {
        "id": "d1",
        "type": "santa",
        "x": 10,
        "y": 15,
        "scale": 1.5,
        "visible": true
      },
      {
        "id": "d2",
        "type": "tree",
        "x": 85,
        "y": 65,
        "scale": 2,
        "visible": true
      },
      {
        "id": "d3",
        "type": "snowman",
        "x": 15,
        "y": 75,
        "scale": 1.5,
        "visible": true
      }
    ],
    "posts": [],
    "bgmUrl": "bgm/%E5%87%A0%E5%88%86%E4%B9%8B%E5%87%A0.mp3"
  }
];


// Expanded asset list with bigger/complex emojis
export const DECORATION_ASSETS: Record<DecorationType, string> = {
  santa: '🎅🦌🛷', // Santa with reindeer and sleigh
  bigtree: '🎄',
  sock: '🧦',
  cat: '🐱',
  dog: '🐶',
  star: '🌟',
  gift: '🎁',
  rainbow: '🌈',
  flower: '🌸',
  moon: '🌙',
  snowman: '⛄',
  bell: '🔔',
  lantern: '🏮',
  firecracker: '🧨',
  umbrella: '☂️',
  milk: '🧋',
  flash: '⚡️',
  beatheart: '💗',
  popcorn: '🍿',
  film: '🎥',
  camera: '📸',
  train: '🚆',
  ticket: '🎫',
  tree: '🌳',
  temple: '🛕',
  five: '5⃣',
  zero: '0⃣',
  cake: '🎂',
  one: '1⃣'
};

export const DECORATION_NAMES: Record<DecorationType, string> = {
  santa: '飞天圣诞老人',
  bigtree: '大圣诞树',
  sock: '圣诞袜',
  cat: '小猫咪',
  dog: '小狗狗',
  star: '闪亮星星',
  gift: '礼物盒',
  rainbow: '彩虹',
  flower: '小发发',
  moon: '弯弯月亮',
  snowman: '雪人',
  bell: '铃铛',
  lantern: '红灯笼',
  firecracker: '鞭炮',
  umbrella: '雨伞',
  milk: '奶茶',
  flash: '闪电',
  beatheart: '跳动的心',
  popcorn: '爆米花',
  film: '电影',
  camera: 'CCD',
  train: '火车',
  ticket: '车票',
  tree: '树',
  temple: '寺庙',
  five: '5',
  zero: '0',
  cake: '蛋糕',
  one: '1'
};

// Helper array for the UI loop
export const AVAILABLE_DECORATIONS: DecorationType[] = [
  'santa', 'bigtree', 'snowman', 'sock', 'gift', 'bell', 
  'cat', 'dog', 'star', 'moon', 'rainbow', 'flower', 
  'lantern', 'firecracker', 'umbrella', 'milk', 'flash', 
  'beatheart', 'popcorn','film','camera', 'train', 'ticket',
  'tree', 'temple', 'five', 'zero', 'cake', 'one'
];
